Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/ATSAMHA1G16AB_DFP/component/fuses.h
/** \brief FUSES register offsets definitions */
#define FUSES_TEMP_LOG_WORD_0_REG_OFST _UINT32_(0x00)      /* (FUSES_TEMP_LOG_WORD_0) TEMP_LOG Page Word 0 Offset */
#define FUSES_TEMP_LOG_WORD_1_REG_OFST _UINT32_(0x04)      /* (FUSES_TEMP_LOG_WORD_1) TEMP_LOG Page Word 1 Offset */
#define FUSES_AUX3_WORD_3_REG_OFST     _UINT32_(0x0C)      /* (FUSES_AUX3_WORD_3) AUX3 Page Word 3 Offset */
#define FUSES_AUX3_WORD_16_REG_OFST    _UINT32_(0x40)      /* (FUSES_AUX3_WORD_16) AUX3 Page Word 16 Offset */
#define FUSES_AUX3_WORD_17_REG_OFST    _UINT32_(0x44)      /* (FUSES_AUX3_WORD_17) AUX3 Page Word 17 Offset */
#define FUSES_AUX3_WORD_18_REG_OFST    _UINT32_(0x48)      /* (FUSES_AUX3_WORD_18) AUX3 Page Word 18 Offset */
#define FUSES_OTP4_WORD_0_REG_OFST     _UINT32_(0x00)      /* (FUSES_OTP4_WORD_0) OTP4 Page Word 0 Offset */
#define FUSES_OTP4_WORD_1_REG_OFST     _UINT32_(0x04)      /* (FUSES_OTP4_WORD_1) OTP4 Page Word 1 Offset */
#define FUSES_OTP4_WORD_2_REG_OFST     _UINT32_(0x08)      /* (FUSES_OTP4_WORD_2) OTP4 Page Word 2 Offset */
#define FUSES_USER_WORD_0_REG_OFST     _UINT32_(0x00)      /* (FUSES_USER_WORD_0) USER Page Word 0 Offset */
#define FUSES_USER_WORD_1_REG_OFST     _UINT32_(0x04)      /* (FUSES_USER_WORD_1) USER Page Word 1 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TEMP_LOG_FUSES register API structure */
typedef struct
{
  __I   uint32_t                       FUSES_TEMP_LOG_WORD_0; /**< Offset: 0x00 (R/   32) TEMP_LOG Page Word 0 */
  __I   uint32_t                       FUSES_TEMP_LOG_WORD_1; /**< Offset: 0x04 (R/   32) TEMP_LOG Page Word 1 */
} fuses_temp_log_fuses_registers_t;

/** \brief AUX3_FUSES register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x0C];
  __I   uint32_t                       FUSES_AUX3_WORD_3;  /**< Offset: 0x0C (R/   32) AUX3 Page Word 3 */
  __I   uint8_t                        Reserved2[0x30];
  __I   uint32_t                       FUSES_AUX3_WORD_16; /**< Offset: 0x40 (R/   32) AUX3 Page Word 16 */
  __I   uint32_t                       FUSES_AUX3_WORD_17; /**< Offset: 0x44 (R/   32) AUX3 Page Word 17 */
  __I   uint32_t                       FUSES_AUX3_WORD_18; /**< Offset: 0x48 (R/   32) AUX3 Page Word 18 */
} fuses_aux3_fuses_registers_t;

/** \brief OTP4_FUSES register API structure */
typedef struct
{
  __I   uint32_t                       FUSES_OTP4_WORD_0;  /**< Offset: 0x00 (R/   32) OTP4 Page Word 0 */
  __I   uint32_t                       FUSES_OTP4_WORD_1;  /**< Offset: 0x04 (R/   32) OTP4 Page Word 1 */
  __I   uint32_t                       FUSES_OTP4_WORD_2;  /**< Offset: 0x08 (R/   32) OTP4 Page Word 2 */
} fuses_otp4_fuses_registers_t;

/** \brief USER_FUSES register API structure */
typedef struct
{
  __IO  uint32_t                       FUSES_USER_WORD_0;  /**< Offset: 0x00 (R/W  32) USER Page Word 0 */
  __IO  uint32_t                       FUSES_USER_WORD_1;  /**< Offset: 0x04 (R/W  32) USER Page Word 1 */
} fuses_user_fuses_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMHA1_FUSES_COMPONENT_H_ */
